목 차

01. JOIN

02. FROM 절 JOIN 형태

03. 셀프 조인

01. JOIN

JOIN(교집합)

두 개 이상의 테이블들을
연결 또는 결합하여 데이터를 출력하는 것

연산자에 따라 JOIN 방식 분류 시

EQUI JOIN          Non EQUI JOIN

EQUI JOIN(등가 교집합)

두 개의 테이블 간의 서로 정확하게 일치하는 경우를 활용하는 조인

간단히 말해, 등가 연산자를 사용한 조인을 의미

=

대부분 기본키-외래키 관계를 기반으로 발생하나,
모든 조인이 그런 것은 아니다

 Non EQUI JOIN(비등가 교집합)
 
 두 개의 테이블 간에 서로 정확하게 일치하지 않는 경우를 활용하는 조인
 
 간단히 말해,
 등가 연산자(=) 이외의 연산자들을 사용한 조인을 의미
 
 > >= <= < BETWEEN

[이론]FROM절 JOIN형태 - INNER JOIN/ON

INNER JOIN

내부 JOIN이라고 하며 JOIN조건에서
동일한 값이 있는 행만 반환
INNER JOIN은 JOIN의 기본값으로
INNER생략 가능


예시
SELECT * FROM 테이블1 [INNER]JOIN테이블2
                     ------------------
INNER JOIN구로 테이블정의

ON 테이블1.컬럼명 = 테이블2.컬럼명 ;
- ON구를 사용해 조인 조건 지정

INNER JOIN

USER
USER_ID    NAME      CLASS_ID
1000       모자장수    001
1001       엘리스토끼  002
1002       체셔       001
1003       도도새     002

CLASS
ID         CLASS
001        A
002        B

예시
SELECT * FROM USER AS a JOIN CLASS AS b
ON a.CLASS_ID = b.ID;
- ON조건절을 활용하면 컬럼명이 다르더라도 JOIN조건을 사용 가능

결과값 
USER_ID    NAME      CLASS_ID     ID     CLASS    
1000       모자장수    001         001       A
1001       엘리스토끼  002         002       B
1002       체셔       001         001       A
1003       도도새     002          002       B

FROM절 JOIN 형태 - INNER JOIN/ON
EMPLOYEE 테이블과 POSITION_T 테이블에는 각 테이블의 구조에 맞도록 사원 정보 및 직급 정보가 담겨 있습니다.

EMPLOYEE 테이블의 사원 정보에는 직급의 명칭이 담겨있지 않고, 어떤 직급인지에 대한 직급 ID가 담겨있습니다.

각 사원 정보에 따라서 직급 명칭을 알기 위해 INNER JOIN과 ON을 활용하여 사원 번호(EMPLOYEE_ID), 이름(NAME), 직급 명칭(POSITION_NAME) 을 조회하는 쿼리를 작성해봅시다.



지시사항
EMPLOYEE테이블과 POSITION_T 테이블에서 직급 ID(POSITION_ID) 가 같은 데이터에 대해 INNER JOIN절 과 ON절을 이용하여 사원 번호(EMPLOYEE_ID), 이름(NAME), 직급 명칭(POSITION_NAME) 을 조회하는 쿼리를 작성하세요.

Tips!
결과에 대해 ORDER BY 를 이용하여 사원 번호를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래 쿼리는 EMPLOYEE, POSITION_T 테이블의 구조를 나타냅니다. 해당 테이블을 수정할 필요는 없습니다.
DESC EMPLOYEE;
DESC POSITION_T;

SELECT * FROM EMPLOYEE;
SELECT * FROM POSITION_T;

-- EMPLOYEE 테이블과 POSITION_T 테이블에 대해 POSITION_ID가 같은 데이터에 대해
-- 사원번호(EMPLOYEE_ID)와 이름(NAME), 직급명칭(POSITION_NAME)을 조회하는 쿼리를 작성해보세요.

SELECT EMPLOYEE_ID, NAME, POSITION_NAME 
FROM EMPLOYEE AS a JOIN POSITION_T AS b
ON a.POSITION_ID = b.POSITION_ID;
'''

'''

+---------------+-------------+------+-----+---------+-------+
| Field         | Type        | Null | Key | Default | Extra |
+---------------+-------------+------+-----+---------+-------+
| POSITION_ID   | varchar(10) | NO   | PRI | NULL    |       |
| POSITION_NAME | varchar(50) | NO   |     | NULL    |       |
+---------------+-------------+------+-----+---------+-------+
+-------------+------+-------------+
| EMPLOYEE_ID | NAME | POSITION_ID |
+-------------+------+-------------+
| E001        | kim  | P01         |
| E002        | song | P02         |
| E003        | kim  | P02         |
| E004        | kim  | P03         |
| E005        | moon | P03         |
| E006        | lee  | P04         |
+-------------+------+-------------+
+-------------+---------------+
| POSITION_ID | POSITION_NAME |
+-------------+---------------+
| P01         | 부장          |
| P02         | 차장          |
| P03         | 과장          |
| P04         | 대리          |
+-------------+---------------+
+-------------+------+---------------+
| EMPLOYEE_ID | NAME | POSITION_NAME |
+-------------+------+---------------+
| E001        | kim  | 부장          |
| E002        | song | 차장          |
| E003        | kim  | 차장          |
| E004        | kim  | 과장          |
| E005        | moon | 과장          |
| E006        | lee  | 대리          |
+-------------+------+---------------+
'''

FROM절 JOIN 형태 - INNER JOIN/ON
STORE 테이블에는 가게 타입 코드와 가게 이름 정보가 담겨 있으며, STORE_TYPE_CODE 테이블에는 가게 타입 코드와 타입 이름 정보가 담겨 있습니다.

STORE 테이블에는 어떠한 타입의 가게인지 가게 타입 이름이 저장되어 있지 않고, 가게 타입 코드 정보가 저장되어 있습니다. STORE_TYPE_CODE 테이블을 이용하여 STORE 테이블에서 각 가게가 어떤 가게 타입인지 코드가 아닌 이름으로 표현되도록 쿼리를 작성해봅시다.

STORE 테이블에 대해서 STORE_TYPE_CODE 테이블과 가게 타입 코드(store_type_code) 를 이용하여 INNER JOIN를 실시해 가게 이름(store_name)과 타입 이름(store_type_name) 을 조회하는 쿼리를 작성해봅시다.

지시사항
STORE테이블과 STORE_TYPE_CODE 테이블에서 가게 타입 코드(store_type_code) 가 같은 데이터에 대해 INNER JOIN절 과 ON절을 이용하여 가게 이름(store_name)과 타입 이름(store_type_name) 을 조회하는 쿼리를 작성하세요.

Tips!
결과에 대해 ORDER BY 를 이용하여 가게 이름을 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래 쿼리는 STORE, STORE_TYPE_CODE 테이블의 구조를 나타냅니다. 해당 테이블을 수정할 필요는 없습니다.
DESC STORE;
DESC STORE_TYPE_CODE;

SELECT * FROM STORE;
SELECT * FROM STORE_TYPE_CODE;

-- STORE 테이블과 STORE_TYPE_CODE 테이블에 대해 store_type_code 컬럼을 이용하여 조인을 실시해,
-- 가게이름(store_name)과 타입이름(store_type_name)을 조회하는 쿼리를 작성해보세요.
SELECT store_name, store_type_name
FROM STORE INNER JOIN STORE_TYPE_CODE
ON STORE.store_type_code = STORE_TYPE_CODE.store_type_code
ORDER BY store_name ASC;

'''

'''
+-----------------+--------------+------+-----+---------+-------+
| Field           | Type         | Null | Key | Default | Extra |
+-----------------+--------------+------+-----+---------+-------+
| store_id        | int(11)      | NO   | PRI | NULL    |       |
| store_type_code | varchar(100) | NO   |     | NULL    |       |
| store_name      | varchar(100) | NO   |     | NULL    |       |
+-----------------+--------------+------+-----+---------+-------+
+-----------------+--------------+------+-----+---------+-------+
| Field           | Type         | Null | Key | Default | Extra |
+-----------------+--------------+------+-----+---------+-------+
| store_type_code | varchar(100) | NO   | PRI | NULL    |       |
| store_type_name | varchar(100) | NO   |     | NULL    |       |
+-----------------+--------------+------+-----+---------+-------+
+----------+-----------------+------------+
| store_id | store_type_code | store_name |
+----------+-----------------+------------+
|    10001 | S001V           | store1     |
|    10002 | S002V           | store2     |
|    10003 | S001A           | store3     |
|    10004 | S002V           | store4     |
|    10005 | S001A           | store5     |
|    10006 | S001A           | store6     |
+----------+-----------------+------------+
+-----------------+-----------------+
| store_type_code | store_type_name |
+-----------------+-----------------+
| S001A           | Type-AA         |
| S001V           | Type-A          |
| S002A           | Type-BB         |
| S002V           | Type-B          |
| S003V           | Type-C          |
+-----------------+-----------------+
+------------+-----------------+
| store_name | store_type_name |
+------------+-----------------+
| store1     | Type-A          |
| store2     | Type-B          |
| store3     | Type-AA         |
| store4     | Type-B          |
| store5     | Type-AA         |
| store6     | Type-AA         |
+------------+-----------------+
'''

[이론] FROM절 JOIN 형태 - INNER JOIN/ USING/ NATURAL JOIN

USING 조건절

같은 이름을 가진 컬럼들 중 원하는 컬럼에
대해서만 선택적으로 등가 조인 가능

SQL Server에서는 지원X

예시
SELECT * FROM 테이블1 JOIN 테이블2
USING (기준컬럼);
- USING조건절 사용시에는 컬럼이나 테이블에 별칭을 붙일 수 없음

NATURAL JOIN

두 테이블 간의 동일한 이름을 갖는 모든
컬럼들에 대해 등가 조인을 수행

예시
SELECT * FROM 테이블1 NATURAL JOIN 테이블2;
- 추가로 ON 조건절이나 USING 조건절,
  WHERE절에서 JOIN조건 정의 불가

NATURAL JOIN

USER
USER_ID    NAME      CLASS_ID
1000       모자장수    001
1001       엘리스토끼  002
1002       체셔       001
1003       도도새     002

CLASS
CLASS_ID         CLASS
   001             A
   002             B

예시 
SELECT * FROM USER NATURAL JOIN CLASS;
-             -----------------------
- INNER JOIN과 달리 별칭 지정 불가


결과값 
USER_ID    NAME      CLASS_ID        CLASS    
1000       모자장수       001            A
1001       엘리스토끼     002             B
1002       체셔          001            A
1003       도도새        002             B

FROM절 JOIN 형태 - INNER JOIN/USING
STUDENT 테이블에는 학생 번호와 학생 이름 정보가, CLASS 테이블에는 과목 번호와 과목 이름이, 그리고 CLASS_REQUEST테이블에는 신청 번호에 대한 학생 번호와 과목 번호 정보가 담겨 있습니다.

CLASS_REQUEST 테이블에는 학생 이름과 과목 이름 정보가 담겨있지 않고, 학생 번호와 과목 번호 정보가 담겨있습니다.
이에 대해서 CLASS_REQUEST의 각 데이터에 대해 과목 이름과 학생 이름 정보를 함께 출력해봅시다.

CLASS_REQUEST 테이블을 기준으로, 신청 번호에 따른 학생 이름과 과목 이름의 정보를 조회하려고 합니다. JOIN 절과 USING 절을 이용하여, CLASS_REQUEST 테이블에 STUDENT 테이블과 CLASS 테이블을 결합하여, 신청 번호(REQUEST_ID), 학생 이름(STUDENT_NAME), 과목 이름(CLASS_NAME) 정보를 조회하는 쿼리를 작성해봅시다.



지시사항
CLASS_REQUEST테이블에 대해 STUDENT 테이블을 INNER JOIN절 과 USING절을 이용하여 결합하고 신청 번호(REQUEST_ID)와 학생 이름(STUDENT_NAME) 을 조회하는 쿼리를 작성하세요.

CLASS_REQUEST테이블에 대해 CLASS 테이블을 INNER JOIN절 과 USING절을 이용하여 결합하고 신청 번호(REQUEST_ID)와 과목 이름(CLASS_NAME) 을 조회하는 쿼리를 작성하세요.

CLASS_REQUEST테이블에 대해 STUDENT 테이블과 CLASS테이블을 INNER JOIN절 과 USING절을 이용하여 결합하고 신청 번호(REQUEST_ID)와 학생 이름(STUDENT_NAME), 과목 이름(CLASS_NAME) 을 조회하는 쿼리를 작성하세요.

Tips!
1, 2, 3번 결과에 대해 ORDER BY 를 이용하여 신청 번호를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래 쿼리는 CLASS_REQUEST, STUDENT, CLASS 테이블의 구조를 나타냅니다. 해당 테이블을 수정할 필요는 없습니다.
DESC CLASS_REQUEST;
DESC STUDENT;
DESC CLASS;

SELECT * FROM CLASS_REQUEST;
SELECT * FROM STUDENT;
SELECT * FROM CLASS;

-- 1. CLASS_REQUEST 테이블에 대해 JOIN절과 USING을 이용해 STUDENT테이블과 결합하여
-- 신청번호(REQUEST_ID)와 학생이름(STUDENT_NAME)을 조회하는 쿼리를 작성해보세요.
SELECT REQUEST_ID, STUDENT_NAME
FROM CLASS_REQUEST INNER JOIN STUDENT
USING(STUDENT_ID)
ORDER BY REQUEST_ID ASC;

-- 2. CLASS_REQUEST 테이블에 대해 JOIN절과 USING을 이용해 CLASS테이블과 결합하여
-- 신청번호(REQUEST_ID)와 과목이름(CLASS_NAME)을 조회하는 쿼리를 작성해보세요.
SELECT REQUEST_ID, CLASS_NAME
FROM CLASS_REQUEST INNER JOIN CLASS
USING(CLASS_ID)
ORDER BY REQUEST_ID ASC;

-- 3. CLASS_REQUEST 테이블에 대해 JOIN절과 USING을 이용해 STUDENT테이블, CLASS테이블과 결합하여
-- 신청번호(REQUEST_ID)와 학생이름(STUDENT_NAME), 과목이름(CLASS_NAME)을 조회하는 쿼리를 작성해보세요.

SELECT REQUEST_ID, STUDENT_NAME, CLASS_NAME
FROM CLASS_REQUEST 
INNER JOIN STUDENT USING(STUDENT_ID)
INNER JOIN CLASS USING(CLASS_ID)
ORDER BY REQUEST_ID ASC;
'''

'''
+------------+-------------+------+-----+---------+-------+
| Field      | Type        | Null | Key | Default | Extra |
+------------+-------------+------+-----+---------+-------+
| REQUEST_ID | varchar(10) | NO   | PRI | NULL    |       |
| STUDENT_ID | varchar(10) | NO   |     | NULL    |       |
| CLASS_ID   | varchar(10) | NO   |     | NULL    |       |
+------------+-------------+------+-----+---------+-------+
+--------------+-------------+------+-----+---------+-------+
| Field        | Type        | Null | Key | Default | Extra |
+--------------+-------------+------+-----+---------+-------+
| STUDENT_ID   | varchar(10) | NO   | PRI | NULL    |       |
| STUDENT_NAME | varchar(30) | NO   |     | NULL    |       |
+--------------+-------------+------+-----+---------+-------+
+------------+-------------+------+-----+---------+-------+
| Field      | Type        | Null | Key | Default | Extra |
+------------+-------------+------+-----+---------+-------+
| CLASS_ID   | varchar(10) | NO   | PRI | NULL    |       |
| CLASS_NAME | varchar(30) | NO   |     | NULL    |       |
+------------+-------------+------+-----+---------+-------+
+------------+------------+----------+
| REQUEST_ID | STUDENT_ID | CLASS_ID |
+------------+------------+----------+
| R0001      | S001       | C002     |
| R0002      | S002       | C001     |
| R0003      | S002       | C002     |
| R0004      | S003       | C001     |
+------------+------------+----------+
+------------+--------------+
| STUDENT_ID | STUDENT_NAME |
+------------+--------------+
| S001       | Kim          |
| S002       | Moon         |
| S003       | Lee          |
+------------+--------------+
+----------+------------+
| CLASS_ID | CLASS_NAME |
+----------+------------+
| C001     | Math       |
| C002     | Korean     |
+----------+------------+
+------------+--------------+
| REQUEST_ID | STUDENT_NAME |
+------------+--------------+
| R0001      | Kim          |
| R0002      | Moon         |
| R0003      | Moon         |
| R0004      | Lee          |
+------------+--------------+
+------------+------------+
| REQUEST_ID | CLASS_NAME |
+------------+------------+
| R0001      | Korean     |
| R0002      | Math       |
| R0003      | Korean     |
| R0004      | Math       |
+------------+------------+
+------------+--------------+------------+
| REQUEST_ID | STUDENT_NAME | CLASS_NAME |
+------------+--------------+------------+
| R0001      | Kim          | Korean     |
| R0002      | Moon         | Math       |
| R0003      | Moon         | Korean     |
| R0004      | Lee          | Math       |
+------------+--------------+------------+
'''

BER 테이블에는 멤버의 정보가 담겨있습니다.

하지만 LOGIN_HISTORY 테이블에는 멤버의 이름 정보가 담겨 있지 않고, 멤버 ID정보가 담겨있습니다. JOIN을 활용하여 로그인 이력 정보에 멤버 이름을 함께 출력해봅시다.

LOGIN_HISTORY 테이블에 있는 멤버 ID(MEMBER_ID) 를 통해 MEMBER테이블과 NATURAL JOIN으로 결합해 로그인 이력 ID(login_history_id), 멤버 이름(member_name), 멤버 이메일(member_email), 로그인 시각(login_date) 정보를 출력하는 쿼리를 작성해봅시다.


지시사항
LOGIN_HISTORY테이블과 MEMBER 테이블에 대해 NATURAL JOIN을 이용하여 로그인 이력 ID(login_history_id), 멤버 이름(member_name), 멤버 이메일(member_email), 로그인 시각(login_date) 을 조회하는 쿼리를 작성하세요.

Tips!
결과에 대해 ORDER BY 를 이용하여 로그인 이력 ID를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래 쿼리는 LOGIN_HISTORY, MEMBER 테이블의 구조를 나타냅니다. 해당 테이블을 수정할 필요는 없습니다.
DESC LOGIN_HISTORY;
DESC MEMBER;

SELECT * FROM LOGIN_HISTORY;
SELECT * FROM MEMBER;
-- LOGIN_HISTORY테이블과 MEMBER테이블에 대해 NATURAL JOIN을 이용하여 조회하고자 하는 컬럼을 출력해보세요.

SELECT login_history_id, member_name, member_email, login_date
FROM LOGIN_HISTORY 
NATURAL JOIN MEMBER
ORDER BY login_history_id;
'''

'''
+------------------+----------+------+-----+---------+-------+
| Field            | Type     | Null | Key | Default | Extra |
+------------------+----------+------+-----+---------+-------+
| LOGIN_HISTORY_ID | int(11)  | NO   | PRI | NULL    |       |
| MEMBER_ID        | int(11)  | NO   |     | NULL    |       |
| LOGIN_DATE       | datetime | NO   |     | NULL    |       |
+------------------+----------+------+-----+---------+-------+
+--------------+--------------+------+-----+---------+-------+
| Field        | Type         | Null | Key | Default | Extra |
+--------------+--------------+------+-----+---------+-------+
| MEMBER_ID    | int(11)      | NO   | PRI | NULL    |       |
| MEMBER_NAME  | varchar(10)  | NO   |     | NULL    |       |
| MEMBER_EMAIL | varchar(100) | NO   |     | NULL    |       |
+--------------+--------------+------+-----+---------+-------+
+------------------+-----------+---------------------+
| LOGIN_HISTORY_ID | MEMBER_ID | LOGIN_DATE          |
+------------------+-----------+---------------------+
|                1 |     10002 | 2021-04-01 13:41:23 |
|                2 |     10003 | 2021-04-01 19:21:41 |
|                4 |     10002 | 2021-04-02 16:18:39 |
+------------------+-----------+---------------------+
+-----------+-------------+----------------+
| MEMBER_ID | MEMBER_NAME | MEMBER_EMAIL   |
+-----------+-------------+----------------+
|     10001 | Kim         | kim@naver.com  |
|     10002 | Moon        | moon@naver.com |
|     10003 | Lee         | lee@naver.com  |
+-----------+-------------+----------------+
+------------------+-------------+----------------+---------------------+
| login_history_id | member_name | member_email   | login_date          |
+------------------+-------------+----------------+---------------------+
|                1 | Moon        | moon@naver.com | 2021-04-01 13:41:23 |
|                2 | Lee         | lee@naver.com  | 2021-04-01 19:21:41 |
|                4 | Moon        | moon@naver.com | 2021-04-02 16:18:39 |
+------------------+-------------+----------------+---------------------+
'''

[이론] FROM절 JOIN 형태 - CROSS JOIN

CROSS JOIN

JOIN조건이 없는 경우 생길 수 있는
모든 데이터의 조합을 조회


USER
 ID        NAME       AGE
1000       모자장수     25
1001       엘리스토끼   10
1002       체셔        15
1003       도도새       20

CLASS
CLASS_ID         CLASS
   001             A
   002             B
   
   
결과값
 ID        NAME       AGE   CLASS_ID  CLASS
1000       모자장수     25    001        A    
1000       모자장수     25    002        B    
1001       엘리스토끼   10    001        A
1001       엘리스토끼   10    002        B
1002       체셔        15    001        A
1002       체셔        15    002        B
1003       도도새       20   001         A
1003       도도새       20   002         B

CROSS JOIN

예시
SELECT * FROM PERSON
(CROSS) JOIN PUBLIC_TRANSPORT;
 - ON USING이 없으면 CROSS JOIN 
 - NATRUAL을 쓰지 않을 경우 CROSS JOIN 
PERSON
ID    NAME     PHONE
1     KIM       010
2     MOON      011

PUBLIC_TRANSPORT
TRANSPORT_ID       TYPE
 01A               BUS
 01B               SUBWAY
 02A               CAB
 
 
 결과값
 ID    NAME     PHONE     TRANSPORT_ID     TYPE
  1     KIM       010     01A               BUS    
  1     KIM       010     01B               SUBWAY
  1     KIM       010     02A               CAB     
  2     MOON      011     01A               BUS   
  2     MOON      011     01B               SUBWAY
  2     MOON      011     02A               CAB

FROM절 JOIN 형태 - CROSS JOIN
FIRST_NAME_T 테이블과 LAST_NAME_T 테이블에는 각 테이블의 구조에 맞도록 id 값과 first_name 또는 last_name 정보가 담겨 있습니다.

FIRST_NAME_T 테이블의 데이터와 LAST_NAME_T 테이블의 데이터를 결합하면 가상의 이름 데이터 하나가 출력됩니다. 그럼 각 테이블의 모든 데이터를 이용하여 first_name과 last_name에 대한 모든 경우의 수를 구해봅시다.

가능한 이름의 조합에 대해 모든 경우의 수를 출력하기 위해 CROSS JOIN을 활용하려고 합니다.
FIRST_NAME_T 테이블과 LAST_NAME_T 테이블에 대해서 CROSS JOIN을 통해 결합하여 first_name과 last_name을 출력하여 가능한 모든 케이스를 조회하는 쿼리를 작성해봅시다.


지시사항
FIRST_NAME_T 테이블과 LAST_NAME_T 테이블을 CROSS JOIN으로 결합하고 first_name, last_name 을 출력하는 쿼리를 작성하세요.

Tips!
결과에 대해 ORDER BY 를 이용하여 first_name를 기준으로 오름차순, last_name을 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래 쿼리는 FIRST_NAME_T, LAST_NAME_T 테이블의 구조를 나타냅니다. 해당 테이블을 수정할 필요는 없습니다.
DESC FIRST_NAME_T;
DESC LAST_NAME_T;

SELECT * FROM FIRST_NAME_T;
SELECT * FROM LAST_NAME_T;
-- FIRST_NAME_T와 LAST_NAME_T를 크로스조인으로 결합하고, first_name과 last_name을 출력하세요.
SELECT first_name, last_name
FROM FIRST_NAME_T
CROSS JOIN LAST_NAME_T
ORDER BY first_name ASC, last_name ASC;

'''

'''
+------------+-------------+------+-----+---------+-------+
| Field      | Type        | Null | Key | Default | Extra |
+------------+-------------+------+-----+---------+-------+
| id         | int(11)     | NO   | PRI | NULL    |       |
| first_name | varchar(10) | NO   |     | NULL    |       |
+------------+-------------+------+-----+---------+-------+
+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| id        | int(11)     | NO   | PRI | NULL    |       |
| last_name | varchar(30) | NO   |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+
+----+------------+
| id | first_name |
+----+------------+
|  1 | Kim        |
|  2 | Lee        |
|  3 | Choi       |
+----+------------+
+----+-----------+
| id | last_name |
+----+-----------+
|  1 | Chulsoo   |
|  2 | Gildong   |
|  3 | Yeonghee  |
+----+-----------+
+------------+-----------+
| first_name | last_name |
+------------+-----------+
| Choi       | Chulsoo   |
| Choi       | Gildong   |
| Choi       | Yeonghee  |
| Kim        | Chulsoo   |
| Kim        | Gildong   |
| Kim        | Yeonghee  |
| Lee        | Chulsoo   |
| Lee        | Gildong   |
| Lee        | Yeonghee  |
+------------+-----------+
'''

[이론] FROM절 JOIN 형태 - OUTER JOIN

OUTER JOIN

두 개의 테이블 간에 교집합을 조회하고
한쪽 테이블에만 있는 데이터도 포함시켜서 조회
빈 곳은 NULL 값으로 출력
WHERE 조건절에서 한쪽에만 있는 데이터를
포함시킬 테이블 쪽으로 (+)를 위치